MikroElektronika/core_packages/PIC/XC8/def/PIC18F87K22/mcu.h
extern volatile T7CONbits_t T7CONbits __at(0xF3D);
// bitfield macros
#define _T7CON_NOT_T7SYNC_POSN                              0x2
#define _T7CON_NOT_T7SYNC_POSITION                          0x2
#define _T7CON_NOT_T7SYNC_SIZE                              0x1
#define _T7CON_NOT_T7SYNC_LENGTH                            0x1
#define _T7CON_NOT_T7SYNC_MASK                              0x4
#define _T7CON_TMR7ON_POSN                                  0x0
#define _T7CON_TMR7ON_POSITION                              0x0
#define _T7CON_TMR7ON_SIZE                                  0x1
#define _T7CON_TMR7ON_LENGTH                                0x1
#define _T7CON_TMR7ON_MASK                                  0x1
#define _T7CON_RD16_POSN                                    0x1
#define _T7CON_RD16_POSITION                                0x1
#define _T7CON_RD16_SIZE                                    0x1
#define _T7CON_RD16_LENGTH                                  0x1
#define _T7CON_RD16_MASK                                    0x2
#define _T7CON_nT7SYNC_POSN                                 0x2
#define _T7CON_nT7SYNC_POSITION                             0x2
#define _T7CON_nT7SYNC_SIZE                                 0x1
#define _T7CON_nT7SYNC_LENGTH                               0x1
#define _T7CON_nT7SYNC_MASK                                 0x4
#define _T7CON_SOSCEN_POSN                                  0x3
#define _T7CON_SOSCEN_POSITION                              0x3
#define _T7CON_SOSCEN_SIZE                                  0x1
#define _T7CON_SOSCEN_LENGTH                                0x1
#define _T7CON_SOSCEN_MASK                                  0x8
#define _T7CON_T7CKPS_POSN                                  0x4
#define _T7CON_T7CKPS_POSITION                              0x4
#define _T7CON_T7CKPS_SIZE                                  0x2
#define _T7CON_T7CKPS_LENGTH                                0x2
#define _T7CON_T7CKPS_MASK                                  0x30
#define _T7CON_TMR7CS_POSN                                  0x6
#define _T7CON_TMR7CS_POSITION                              0x6
#define _T7CON_TMR7CS_SIZE                                  0x2
#define _T7CON_TMR7CS_LENGTH                                0x2
#define _T7CON_TMR7CS_MASK                                  0xC0
#define _T7CON_T7CKPS0_POSN                                 0x4
#define _T7CON_T7CKPS0_POSITION                             0x4
#define _T7CON_T7CKPS0_SIZE                                 0x1
#define _T7CON_T7CKPS0_LENGTH                               0x1
#define _T7CON_T7CKPS0_MASK                                 0x10
#define _T7CON_T7CKPS1_POSN                                 0x5
#define _T7CON_T7CKPS1_POSITION                             0x5
#define _T7CON_T7CKPS1_SIZE                                 0x1
#define _T7CON_T7CKPS1_LENGTH                               0x1
#define _T7CON_T7CKPS1_MASK                                 0x20
#define _T7CON_TMR7CS0_POSN                                 0x6
#define _T7CON_TMR7CS0_POSITION                             0x6
#define _T7CON_TMR7CS0_SIZE                                 0x1
#define _T7CON_TMR7CS0_LENGTH                               0x1
#define _T7CON_TMR7CS0_MASK                                 0x40
#define _T7CON_TMR7CS1_POSN                                 0x7
#define _T7CON_TMR7CS1_POSITION                             0x7
#define _T7CON_TMR7CS1_SIZE                                 0x1
#define _T7CON_TMR7CS1_LENGTH                               0x1
#define _T7CON_TMR7CS1_MASK                                 0x80
#define _T7CON_RD167_POSN                                   0x1
#define _T7CON_RD167_POSITION                               0x1
#define _T7CON_RD167_SIZE                                   0x1
#define _T7CON_RD167_LENGTH                                 0x1
#define _T7CON_RD167_MASK                                   0x2
#define _T7CON_SOSCEN7_POSN                                 0x3
#define _T7CON_SOSCEN7_POSITION                             0x3
#define _T7CON_SOSCEN7_SIZE                                 0x1
#define _T7CON_SOSCEN7_LENGTH                               0x1
#define _T7CON_SOSCEN7_MASK                                 0x8

// Register: TMR7
#define TMR7 TMR7
extern volatile unsigned short          TMR7                __at(0xF3E);
#ifndef _LIB_BUILD
asm("TMR7 equ 0F3Eh");
#endif

// Register: TMR7L
#define TMR7L TMR7L
extern volatile unsigned char           TMR7L               __at(0xF3E);
#ifndef _LIB_BUILD
asm("TMR7L equ 0F3Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR7L                  :8;
    };
    struct {
        unsigned CAL07                  :1;
        unsigned CAL17                  :1;
        unsigned CAL27                  :1;
        unsigned CAL37                  :1;
        unsigned CAL47                  :1;
        unsigned CAL57                  :1;
        unsigned CAL67                  :1;
        unsigned CAL77                  :1;
    };
} TMR7Lbits_t;
extern volatile TMR7Lbits_t TMR7Lbits __at(0xF3E);
// bitfield macros
#define _TMR7L_TMR7L_POSN                                   0x0
#define _TMR7L_TMR7L_POSITION                               0x0
#define _TMR7L_TMR7L_SIZE                                   0x8
#define _TMR7L_TMR7L_LENGTH                                 0x8
#define _TMR7L_TMR7L_MASK                                   0xFF
#define _TMR7L_CAL07_POSN                                   0x0
#define _TMR7L_CAL07_POSITION                               0x0
#define _TMR7L_CAL07_SIZE                                   0x1
#define _TMR7L_CAL07_LENGTH                                 0x1
#define _TMR7L_CAL07_MASK                                   0x1
#define _TMR7L_CAL17_POSN                                   0x1
#define _TMR7L_CAL17_POSITION                               0x1
#define _TMR7L_CAL17_SIZE                                   0x1
#define _TMR7L_CAL17_LENGTH                                 0x1
#define _TMR7L_CAL17_MASK                                   0x2
#define _TMR7L_CAL27_POSN                                   0x2
#define _TMR7L_CAL27_POSITION                               0x2
#define _TMR7L_CAL27_SIZE                                   0x1
#define _TMR7L_CAL27_LENGTH                                 0x1
#define _TMR7L_CAL27_MASK                                   0x4
#define _TMR7L_CAL37_POSN                                   0x3
#define _TMR7L_CAL37_POSITION                               0x3
#define _TMR7L_CAL37_SIZE                                   0x1
#define _TMR7L_CAL37_LENGTH                                 0x1
#define _TMR7L_CAL37_MASK                                   0x8
#define _TMR7L_CAL47_POSN                                   0x4
#define _TMR7L_CAL47_POSITION                               0x4
#define _TMR7L_CAL47_SIZE                                   0x1
#define _TMR7L_CAL47_LENGTH                                 0x1
#define _TMR7L_CAL47_MASK                                   0x10
#define _TMR7L_CAL57_POSN                                   0x5
#define _TMR7L_CAL57_POSITION                               0x5
#define _TMR7L_CAL57_SIZE                                   0x1
#define _TMR7L_CAL57_LENGTH                                 0x1
#define _TMR7L_CAL57_MASK                                   0x20
#define _TMR7L_CAL67_POSN                                   0x6
#define _TMR7L_CAL67_POSITION                               0x6
#define _TMR7L_CAL67_SIZE                                   0x1
#define _TMR7L_CAL67_LENGTH                                 0x1
#define _TMR7L_CAL67_MASK                                   0x40
#define _TMR7L_CAL77_POSN                                   0x7
#define _TMR7L_CAL77_POSITION                               0x7
#define _TMR7L_CAL77_SIZE                                   0x1
#define _TMR7L_CAL77_LENGTH                                 0x1
#define _TMR7L_CAL77_MASK                                   0x80

