MikroElektronika/core_packages/PIC/XC8/def/PIC18F87K22/mcu.h
// Register: IPR4
#define IPR4 IPR4
extern volatile unsigned char           IPR4                __at(0xFB8);
#ifndef _LIB_BUILD
asm("IPR4 equ 0FB8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP3IP                 :1;
        unsigned CCP4IP                 :1;
        unsigned CCP5IP                 :1;
        unsigned CCP6IP                 :1;
        unsigned CCP7IP                 :1;
        unsigned CCP8IP                 :1;
        unsigned CCP9IP                 :1;
        unsigned CCP10IP                :1;
    };
    struct {
        unsigned CCIP3IP                :1;
    };
} IPR4bits_t;
extern volatile IPR4bits_t IPR4bits __at(0xFB8);
// bitfield macros
#define _IPR4_CCP3IP_POSN                                   0x0
#define _IPR4_CCP3IP_POSITION                               0x0
#define _IPR4_CCP3IP_SIZE                                   0x1
#define _IPR4_CCP3IP_LENGTH                                 0x1
#define _IPR4_CCP3IP_MASK                                   0x1
#define _IPR4_CCP4IP_POSN                                   0x1
#define _IPR4_CCP4IP_POSITION                               0x1
#define _IPR4_CCP4IP_SIZE                                   0x1
#define _IPR4_CCP4IP_LENGTH                                 0x1
#define _IPR4_CCP4IP_MASK                                   0x2
#define _IPR4_CCP5IP_POSN                                   0x2
#define _IPR4_CCP5IP_POSITION                               0x2
#define _IPR4_CCP5IP_SIZE                                   0x1
#define _IPR4_CCP5IP_LENGTH                                 0x1
#define _IPR4_CCP5IP_MASK                                   0x4
#define _IPR4_CCP6IP_POSN                                   0x3
#define _IPR4_CCP6IP_POSITION                               0x3
#define _IPR4_CCP6IP_SIZE                                   0x1
#define _IPR4_CCP6IP_LENGTH                                 0x1
#define _IPR4_CCP6IP_MASK                                   0x8
#define _IPR4_CCP7IP_POSN                                   0x4
#define _IPR4_CCP7IP_POSITION                               0x4
#define _IPR4_CCP7IP_SIZE                                   0x1
#define _IPR4_CCP7IP_LENGTH                                 0x1
#define _IPR4_CCP7IP_MASK                                   0x10
#define _IPR4_CCP8IP_POSN                                   0x5
#define _IPR4_CCP8IP_POSITION                               0x5
#define _IPR4_CCP8IP_SIZE                                   0x1
#define _IPR4_CCP8IP_LENGTH                                 0x1
#define _IPR4_CCP8IP_MASK                                   0x20
#define _IPR4_CCP9IP_POSN                                   0x6
#define _IPR4_CCP9IP_POSITION                               0x6
#define _IPR4_CCP9IP_SIZE                                   0x1
#define _IPR4_CCP9IP_LENGTH                                 0x1
#define _IPR4_CCP9IP_MASK                                   0x40
#define _IPR4_CCP10IP_POSN                                  0x7
#define _IPR4_CCP10IP_POSITION                              0x7
#define _IPR4_CCP10IP_SIZE                                  0x1
#define _IPR4_CCP10IP_LENGTH                                0x1
#define _IPR4_CCP10IP_MASK                                  0x80
#define _IPR4_CCIP3IP_POSN                                  0x0
#define _IPR4_CCIP3IP_POSITION                              0x0
#define _IPR4_CCIP3IP_SIZE                                  0x1
#define _IPR4_CCIP3IP_LENGTH                                0x1
#define _IPR4_CCIP3IP_MASK                                  0x1

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0xFB9);
#ifndef _LIB_BUILD
asm("PIE5 equ 0FB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4IE                 :1;
        unsigned TMR5IE                 :1;
        unsigned TMR6IE                 :1;
        unsigned TMR7IE                 :1;
        unsigned TMR8IE                 :1;
        unsigned TMR10IE                :1;
        unsigned TMR12IE                :1;
        unsigned TMR7GIE                :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0xFB9);
// bitfield macros
#define _PIE5_TMR4IE_POSN                                   0x0
#define _PIE5_TMR4IE_POSITION                               0x0
#define _PIE5_TMR4IE_SIZE                                   0x1
#define _PIE5_TMR4IE_LENGTH                                 0x1
#define _PIE5_TMR4IE_MASK                                   0x1
#define _PIE5_TMR5IE_POSN                                   0x1
#define _PIE5_TMR5IE_POSITION                               0x1
#define _PIE5_TMR5IE_SIZE                                   0x1
#define _PIE5_TMR5IE_LENGTH                                 0x1
#define _PIE5_TMR5IE_MASK                                   0x2
#define _PIE5_TMR6IE_POSN                                   0x2
#define _PIE5_TMR6IE_POSITION                               0x2
#define _PIE5_TMR6IE_SIZE                                   0x1
#define _PIE5_TMR6IE_LENGTH                                 0x1
#define _PIE5_TMR6IE_MASK                                   0x4
#define _PIE5_TMR7IE_POSN                                   0x3
#define _PIE5_TMR7IE_POSITION                               0x3
#define _PIE5_TMR7IE_SIZE                                   0x1
#define _PIE5_TMR7IE_LENGTH                                 0x1
#define _PIE5_TMR7IE_MASK                                   0x8
#define _PIE5_TMR8IE_POSN                                   0x4
#define _PIE5_TMR8IE_POSITION                               0x4
#define _PIE5_TMR8IE_SIZE                                   0x1
#define _PIE5_TMR8IE_LENGTH                                 0x1
#define _PIE5_TMR8IE_MASK                                   0x10
#define _PIE5_TMR10IE_POSN                                  0x5
#define _PIE5_TMR10IE_POSITION                              0x5
#define _PIE5_TMR10IE_SIZE                                  0x1
#define _PIE5_TMR10IE_LENGTH                                0x1
#define _PIE5_TMR10IE_MASK                                  0x20
#define _PIE5_TMR12IE_POSN                                  0x6
#define _PIE5_TMR12IE_POSITION                              0x6
#define _PIE5_TMR12IE_SIZE                                  0x1
#define _PIE5_TMR12IE_LENGTH                                0x1
#define _PIE5_TMR12IE_MASK                                  0x40
#define _PIE5_TMR7GIE_POSN                                  0x7
#define _PIE5_TMR7GIE_POSITION                              0x7
#define _PIE5_TMR7GIE_SIZE                                  0x1
#define _PIE5_TMR7GIE_LENGTH                                0x1
#define _PIE5_TMR7GIE_MASK                                  0x80

