MikroElektronika/core_packages/PIC/XC8/def/PIC18F87K22/mcu.h
#define                                 CKTXP_bit           _BIT_ACCESS(BAUDCON1,4)
// PORTA<CLKI>
extern volatile __bit                   CLKI                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 CLKI_bit            _BIT_ACCESS(PORTA,7)
// PORTA<CLKO>
extern volatile __bit                   CLKO                __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 CLKO_bit            _BIT_ACCESS(PORTA,6)
// RCON<CM>
extern volatile __bit                   CM                  __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 CM_bit              _BIT_ACCESS(RCON,5)
// PIE6<CMP1IE>
extern volatile __bit                   CMP1IE              __at(0x7B00);	// @ (0xF60 * 8 + 0)
#define                                 CMP1IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<CMP1IF>
extern volatile __bit                   CMP1IF              __at(0x7D30);	// @ (0xFA6 * 8 + 0)
#define                                 CMP1IF_bit          _BIT_ACCESS(PIR6,0)
// IPR6<CMP1IP>
extern volatile __bit                   CMP1IP              __at(0x7D48);	// @ (0xFA9 * 8 + 0)
#define                                 CMP1IP_bit          _BIT_ACCESS(IPR6,0)
// PMD2<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x78B8);	// @ (0xF17 * 8 + 0)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMD2,0)
// CMSTAT<CMP1OUT>
extern volatile __bit                   CMP1OUT             __at(0x7DA5);	// @ (0xFB4 * 8 + 5)
#define                                 CMP1OUT_bit         _BIT_ACCESS(CMSTAT,5)
// PIE6<CMP2IE>
extern volatile __bit                   CMP2IE              __at(0x7B01);	// @ (0xF60 * 8 + 1)
#define                                 CMP2IE_bit          _BIT_ACCESS(PIE6,1)
// PIR6<CMP2IF>
extern volatile __bit                   CMP2IF              __at(0x7D31);	// @ (0xFA6 * 8 + 1)
#define                                 CMP2IF_bit          _BIT_ACCESS(PIR6,1)
// IPR6<CMP2IP>
extern volatile __bit                   CMP2IP              __at(0x7D49);	// @ (0xFA9 * 8 + 1)
#define                                 CMP2IP_bit          _BIT_ACCESS(IPR6,1)
// PMD2<CMP2MD>
extern volatile __bit                   CMP2MD              __at(0x78B9);	// @ (0xF17 * 8 + 1)
#define                                 CMP2MD_bit          _BIT_ACCESS(PMD2,1)
// CMSTAT<CMP2OUT>
extern volatile __bit                   CMP2OUT             __at(0x7DA6);	// @ (0xFB4 * 8 + 6)
#define                                 CMP2OUT_bit         _BIT_ACCESS(CMSTAT,6)
// PIE6<CMP3IE>
extern volatile __bit                   CMP3IE              __at(0x7B02);	// @ (0xF60 * 8 + 2)
#define                                 CMP3IE_bit          _BIT_ACCESS(PIE6,2)
// PIR6<CMP3IF>
extern volatile __bit                   CMP3IF              __at(0x7D32);	// @ (0xFA6 * 8 + 2)
#define                                 CMP3IF_bit          _BIT_ACCESS(PIR6,2)
// IPR6<CMP3IP>
extern volatile __bit                   CMP3IP              __at(0x7D4A);	// @ (0xFA9 * 8 + 2)
#define                                 CMP3IP_bit          _BIT_ACCESS(IPR6,2)
// PMD2<CMP3MD>
extern volatile __bit                   CMP3MD              __at(0x78BA);	// @ (0xF17 * 8 + 2)
#define                                 CMP3MD_bit          _BIT_ACCESS(PMD2,2)
// CMSTAT<CMP3OUT>
extern volatile __bit                   CMP3OUT             __at(0x7DA7);	// @ (0xFB4 * 8 + 7)
#define                                 CMP3OUT_bit         _BIT_ACCESS(CMSTAT,7)
// PSTR1CON<CMPL0>
extern volatile __bit _DEPRECATED       CMPL0               __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 CMPL0_bit           _BIT_ACCESS(PSTR1CON,6)
// PSTR2CON<CMPL02>
extern volatile __bit                   CMPL02              __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 CMPL02_bit          _BIT_ACCESS(PSTR2CON,6)
// PSTR3CON<CMPL03>
extern volatile __bit                   CMPL03              __at(0x78D6);	// @ (0xF1A * 8 + 6)
#define                                 CMPL03_bit          _BIT_ACCESS(PSTR3CON,6)
// PSTR1CON<CMPL1>
extern volatile __bit _DEPRECATED       CMPL1               __at(0x7CE7);	// @ (0xF9C * 8 + 7)
#define                                 CMPL1_bit           _BIT_ACCESS(PSTR1CON,7)
// PSTR2CON<CMPL12>
extern volatile __bit                   CMPL12              __at(0x78DF);	// @ (0xF1B * 8 + 7)
#define                                 CMPL12_bit          _BIT_ACCESS(PSTR2CON,7)
// PSTR3CON<CMPL13>
extern volatile __bit                   CMPL13              __at(0x78D7);	// @ (0xF1A * 8 + 7)
#define                                 CMPL13_bit          _BIT_ACCESS(PSTR3CON,7)
// CM1CON<COE>
extern volatile __bit _DEPRECATED       COE                 __at(0x7AA6);	// @ (0xF54 * 8 + 6)
#define                                 COE_bit             _BIT_ACCESS(CM1CON,6)
// CM1CON<COE1>
extern volatile __bit                   COE1                __at(0x7AA6);	// @ (0xF54 * 8 + 6)
#define                                 COE1_bit            _BIT_ACCESS(CM1CON,6)
// CM2CON<COE2>
extern volatile __bit                   COE2                __at(0x797E);	// @ (0xF2F * 8 + 6)
#define                                 COE2_bit            _BIT_ACCESS(CM2CON,6)
// CM3CON<COE3>
extern volatile __bit                   COE3                __at(0x7976);	// @ (0xF2E * 8 + 6)
#define                                 COE3_bit            _BIT_ACCESS(CM3CON,6)
// CM1CON<CON>
extern volatile __bit _DEPRECATED       CON                 __at(0x7AA7);	// @ (0xF54 * 8 + 7)
#define                                 CON_bit             _BIT_ACCESS(CM1CON,7)
// CM1CON<CON1>
extern volatile __bit                   CON1                __at(0x7AA7);	// @ (0xF54 * 8 + 7)
#define                                 CON1_bit            _BIT_ACCESS(CM1CON,7)
// CM2CON<CON2>
extern volatile __bit                   CON2                __at(0x797F);	// @ (0xF2F * 8 + 7)
#define                                 CON2_bit            _BIT_ACCESS(CM2CON,7)
// CM3CON<CON3>
extern volatile __bit                   CON3                __at(0x7977);	// @ (0xF2E * 8 + 7)
#define                                 CON3_bit            _BIT_ACCESS(CM3CON,7)
// CM1CON<CPOL>
extern volatile __bit _DEPRECATED       CPOL                __at(0x7AA5);	// @ (0xF54 * 8 + 5)
#define                                 CPOL_bit            _BIT_ACCESS(CM1CON,5)
// CM1CON<CPOL1>
extern volatile __bit                   CPOL1               __at(0x7AA5);	// @ (0xF54 * 8 + 5)
#define                                 CPOL1_bit           _BIT_ACCESS(CM1CON,5)
// CM2CON<CPOL2>
extern volatile __bit                   CPOL2               __at(0x797D);	// @ (0xF2F * 8 + 5)
#define                                 CPOL2_bit           _BIT_ACCESS(CM2CON,5)
// CM3CON<CPOL3>
extern volatile __bit                   CPOL3               __at(0x7975);	// @ (0xF2E * 8 + 5)
#define                                 CPOL3_bit           _BIT_ACCESS(CM3CON,5)
// CM1CON<CREF>
extern volatile __bit _DEPRECATED       CREF                __at(0x7AA2);	// @ (0xF54 * 8 + 2)
#define                                 CREF_bit            _BIT_ACCESS(CM1CON,2)
// CM1CON<CREF1>
extern volatile __bit                   CREF1               __at(0x7AA2);	// @ (0xF54 * 8 + 2)
#define                                 CREF1_bit           _BIT_ACCESS(CM1CON,2)
// CM2CON<CREF2>
extern volatile __bit                   CREF2               __at(0x797A);	// @ (0xF2F * 8 + 2)
#define                                 CREF2_bit           _BIT_ACCESS(CM2CON,2)
// CM3CON<CREF3>
extern volatile __bit                   CREF3               __at(0x7972);	// @ (0xF2E * 8 + 2)
#define                                 CREF3_bit           _BIT_ACCESS(CM3CON,2)
// RCSTA1<CREN>
extern volatile __bit _DEPRECATED       CREN                __at(0x7D5C);	// @ (0xFAB * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RCSTA1,4)
// RCSTA1<CREN1>
extern volatile __bit                   CREN1               __at(0x7D5C);	// @ (0xFAB * 8 + 4)
#define                                 CREN1_bit           _BIT_ACCESS(RCSTA1,4)
// RCSTA2<CREN2>
extern volatile __bit                   CREN2               __at(0x7914);	// @ (0xF22 * 8 + 4)
#define                                 CREN2_bit           _BIT_ACCESS(RCSTA2,4)
// PORTE<CS>
extern volatile __bit                   CS                  __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CS_bit              _BIT_ACCESS(PORTE,2)
// TXSTA1<CSRC>
extern volatile __bit _DEPRECATED       CSRC                __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA1,7)
// TXSTA1<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA1,7)
// TXSTA2<CSRC2>
extern volatile __bit                   CSRC2               __at(0x790F);	// @ (0xF21 * 8 + 7)
#define                                 CSRC2_bit           _BIT_ACCESS(TXSTA2,7)
// PORTF<CTDIN>
extern volatile __bit                   CTDIN               __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 CTDIN_bit           _BIT_ACCESS(PORTF,1)
// PORTB<CTED1>
extern volatile __bit                   CTED1               __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 CTED1_bit           _BIT_ACCESS(PORTB,2)
// PORTB<CTED2>
extern volatile __bit                   CTED2               __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CTED2_bit           _BIT_ACCESS(PORTB,3)
// ODCON3<CTMUDS>
extern volatile __bit                   CTMUDS              __at(0x7938);	// @ (0xF27 * 8 + 0)
#define                                 CTMUDS_bit          _BIT_ACCESS(ODCON3,0)
// CTMUCONH<CTMUEN>
extern volatile __bit                   CTMUEN              __at(0x7ABF);	// @ (0xF57 * 8 + 7)
#define                                 CTMUEN_bit          _BIT_ACCESS(CTMUCONH,7)
// PORTF<CTMUI>
extern volatile __bit                   CTMUI               __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 CTMUI_bit           _BIT_ACCESS(PORTF,3)
// PIE3<CTMUIE>
extern volatile __bit                   CTMUIE              __at(0x7D1B);	// @ (0xFA3 * 8 + 3)
#define                                 CTMUIE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<CTMUIF>
extern volatile __bit                   CTMUIF              __at(0x7D23);	// @ (0xFA4 * 8 + 3)
#define                                 CTMUIF_bit          _BIT_ACCESS(PIR3,3)
// IPR3<CTMUIP>
extern volatile __bit                   CTMUIP              __at(0x7D2B);	// @ (0xFA5 * 8 + 3)
#define                                 CTMUIP_bit          _BIT_ACCESS(IPR3,3)
// PMD1<CTMUMD>
extern volatile __bit                   CTMUMD              __at(0x78C6);	// @ (0xF18 * 8 + 6)
#define                                 CTMUMD_bit          _BIT_ACCESS(PMD1,6)
// CTMUCONH<CTMUSIDL>
extern volatile __bit                   CTMUSIDL            __at(0x7ABD);	// @ (0xF57 * 8 + 5)
#define                                 CTMUSIDL_bit        _BIT_ACCESS(CTMUCONH,5)
// PORTD<CTPLS>
extern volatile __bit                   CTPLS               __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 CTPLS_bit           _BIT_ACCESS(PORTD,0)
// CTMUCONH<CTTRIG>
extern volatile __bit                   CTTRIG              __at(0x7AB8);	// @ (0xF57 * 8 + 0)
#define                                 CTTRIG_bit          _BIT_ACCESS(CTMUCONH,0)
// CVRCON<CVR0>
extern volatile __bit                   CVR0                __at(0x7DA8);	// @ (0xFB5 * 8 + 0)
#define                                 CVR0_bit            _BIT_ACCESS(CVRCON,0)
// CVRCON<CVR1>
extern volatile __bit                   CVR1                __at(0x7DA9);	// @ (0xFB5 * 8 + 1)
#define                                 CVR1_bit            _BIT_ACCESS(CVRCON,1)
// CVRCON<CVR2>
extern volatile __bit                   CVR2                __at(0x7DAA);	// @ (0xFB5 * 8 + 2)
#define                                 CVR2_bit            _BIT_ACCESS(CVRCON,2)
// CVRCON<CVR3>
extern volatile __bit                   CVR3                __at(0x7DAB);	// @ (0xFB5 * 8 + 3)
#define                                 CVR3_bit            _BIT_ACCESS(CVRCON,3)
// CVRCON<CVR4>
extern volatile __bit                   CVR4                __at(0x7DAC);	// @ (0xFB5 * 8 + 4)
#define                                 CVR4_bit            _BIT_ACCESS(CVRCON,4)
// PORTF<CVREF>
extern volatile __bit                   CVREF               __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 CVREF_bit           _BIT_ACCESS(PORTF,5)
// CVRCON<CVREN>
extern volatile __bit                   CVREN               __at(0x7DAF);	// @ (0xFB5 * 8 + 7)
#define                                 CVREN_bit           _BIT_ACCESS(CVRCON,7)
// CVRCON<CVROE>
extern volatile __bit                   CVROE               __at(0x7DAE);	// @ (0xFB5 * 8 + 6)
#define                                 CVROE_bit           _BIT_ACCESS(CVRCON,6)
// CVRCON<CVROEN>
extern volatile __bit                   CVROEN              __at(0x7DAE);	// @ (0xFB5 * 8 + 6)
#define                                 CVROEN_bit          _BIT_ACCESS(CVRCON,6)
// CVRCON<CVRR>
extern volatile __bit                   CVRR                __at(0x7DAD);	// @ (0xFB5 * 8 + 5)
#define                                 CVRR_bit            _BIT_ACCESS(CVRCON,5)
// CVRCON<CVRSS>
extern volatile __bit                   CVRSS               __at(0x7DAD);	// @ (0xFB5 * 8 + 5)
#define                                 CVRSS_bit           _BIT_ACCESS(CVRCON,5)
// SSP1STAT<DA>
extern volatile __bit                   DA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<DA1>
extern volatile __bit                   DA1                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA1_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DA2>
extern volatile __bit                   DA2                 __at(0x7B45);	// @ (0xF68 * 8 + 5)
#define                                 DA2_bit             _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<DATA_ADDRESS>
extern volatile __bit _DEPRECATED       DATA_ADDRESS        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DATA_ADDRESS2>
extern volatile __bit                   DATA_ADDRESS2       __at(0x7B45);	// @ (0xF68 * 8 + 5)
#define                                 DATA_ADDRESS2_bit   _BIT_ACCESS(SSP2STAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP10CON<DC10B0>
extern volatile __bit                   DC10B0              __at(0x7A04);	// @ (0xF40 * 8 + 4)
#define                                 DC10B0_bit          _BIT_ACCESS(CCP10CON,4)
// CCP10CON<DC10B1>
extern volatile __bit                   DC10B1              __at(0x7A05);	// @ (0xF40 * 8 + 5)
#define                                 DC10B1_bit          _BIT_ACCESS(CCP10CON,5)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DDC);	// @ (0xFBB * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x7DDD);	// @ (0xFBB * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x7A74);	// @ (0xF4E * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x7A75);	// @ (0xF4E * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// CCP3CON<DC3B0>
extern volatile __bit                   DC3B0               __at(0x7A4C);	// @ (0xF49 * 8 + 4)
#define                                 DC3B0_bit           _BIT_ACCESS(CCP3CON,4)
// CCP3CON<DC3B1>
extern volatile __bit                   DC3B1               __at(0x7A4D);	// @ (0xF49 * 8 + 5)
#define                                 DC3B1_bit           _BIT_ACCESS(CCP3CON,5)
// CCP4CON<DC4B0>
extern volatile __bit                   DC4B0               __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 DC4B0_bit           _BIT_ACCESS(CCP4CON,4)
// CCP4CON<DC4B1>
extern volatile __bit                   DC4B1               __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 DC4B1_bit           _BIT_ACCESS(CCP4CON,5)
// CCP5CON<DC5B0>
extern volatile __bit                   DC5B0               __at(0x7BA4);	// @ (0xF74 * 8 + 4)
#define                                 DC5B0_bit           _BIT_ACCESS(CCP5CON,4)
// CCP5CON<DC5B1>
extern volatile __bit                   DC5B1               __at(0x7BA5);	// @ (0xF74 * 8 + 5)
#define                                 DC5B1_bit           _BIT_ACCESS(CCP5CON,5)
// CCP6CON<DC6B0>
extern volatile __bit                   DC6B0               __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 DC6B0_bit           _BIT_ACCESS(CCP6CON,4)
// CCP6CON<DC6B1>
extern volatile __bit                   DC6B1               __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 DC6B1_bit           _BIT_ACCESS(CCP6CON,5)
// CCP7CON<DC7B0>
extern volatile __bit                   DC7B0               __at(0x7B74);	// @ (0xF6E * 8 + 4)
#define                                 DC7B0_bit           _BIT_ACCESS(CCP7CON,4)
// CCP7CON<DC7B1>
extern volatile __bit                   DC7B1               __at(0x7B75);	// @ (0xF6E * 8 + 5)
#define                                 DC7B1_bit           _BIT_ACCESS(CCP7CON,5)
// CCP8CON<DC8B0>
extern volatile __bit                   DC8B0               __at(0x7A34);	// @ (0xF46 * 8 + 4)
#define                                 DC8B0_bit           _BIT_ACCESS(CCP8CON,4)
// CCP8CON<DC8B1>
extern volatile __bit                   DC8B1               __at(0x7A35);	// @ (0xF46 * 8 + 5)
#define                                 DC8B1_bit           _BIT_ACCESS(CCP8CON,5)
// CCP9CON<DC9B0>
extern volatile __bit                   DC9B0               __at(0x7A1C);	// @ (0xF43 * 8 + 4)
#define                                 DC9B0_bit           _BIT_ACCESS(CCP9CON,4)
// CCP9CON<DC9B1>
extern volatile __bit                   DC9B1               __at(0x7A1D);	// @ (0xF43 * 8 + 5)
#define                                 DC9B1_bit           _BIT_ACCESS(CCP9CON,5)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,1)
// PORTC<DT1>
extern volatile __bit                   DT1                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 DT1_bit             _BIT_ACCESS(PORTC,7)
// PORTG<DT2>
extern volatile __bit                   DT2                 __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 DT2_bit             _BIT_ACCESS(PORTG,2)
// BAUDCON1<DTRXP>
extern volatile __bit                   DTRXP               __at(0x7B2D);	// @ (0xF65 * 8 + 5)
#define                                 DTRXP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<DTRXP1>
extern volatile __bit                   DTRXP1              __at(0x7B2D);	// @ (0xF65 * 8 + 5)
#define                                 DTRXP1_bit          _BIT_ACCESS(BAUDCON1,5)
// BAUDCON2<DTRXP2>
extern volatile __bit                   DTRXP2              __at(0x7905);	// @ (0xF20 * 8 + 5)
#define                                 DTRXP2_bit          _BIT_ACCESS(BAUDCON2,5)
// SSP1STAT<D_A>
extern volatile __bit _DEPRECATED       D_A                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_A_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_A2>
extern volatile __bit                   D_A2                __at(0x7B45);	// @ (0xF68 * 8 + 5)
#define                                 D_A2_bit            _BIT_ACCESS(SSP2STAT,5)
// SSP2STAT<D_NOT_A2>
extern volatile __bit                   D_NOT_A2            __at(0x7B45);	// @ (0xF68 * 8 + 5)
#define                                 D_NOT_A2_bit        _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<D_nA>
extern volatile __bit _DEPRECATED       D_nA                __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_nA2>
extern volatile __bit                   D_nA2               __at(0x7B45);	// @ (0xF68 * 8 + 5)
#define                                 D_nA2_bit           _BIT_ACCESS(SSP2STAT,5)
// MEMCON<EBDIS>
extern volatile __bit                   EBDIS               __at(0x7937);	// @ (0xF26 * 8 + 7)
#define                                 EBDIS_bit           _BIT_ACCESS(MEMCON,7)
// ECCP1AS<ECCP1AS0>
extern volatile __bit                   ECCP1AS0            __at(0x7DFC);	// @ (0xFBF * 8 + 4)
#define                                 ECCP1AS0_bit        _BIT_ACCESS(ECCP1AS,4)
// ECCP1AS<ECCP1AS1>
extern volatile __bit                   ECCP1AS1            __at(0x7DFD);	// @ (0xFBF * 8 + 5)
#define                                 ECCP1AS1_bit        _BIT_ACCESS(ECCP1AS,5)
// ECCP1AS<ECCP1AS2>
extern volatile __bit                   ECCP1AS2            __at(0x7DFE);	// @ (0xFBF * 8 + 6)
#define                                 ECCP1AS2_bit        _BIT_ACCESS(ECCP1AS,6)
// ECCP1AS<ECCP1ASE>
extern volatile __bit                   ECCP1ASE            __at(0x7DFF);	// @ (0xFBF * 8 + 7)
#define                                 ECCP1ASE_bit        _BIT_ACCESS(ECCP1AS,7)
// ECCP2AS<ECCP2AS0>
extern volatile __bit                   ECCP2AS0            __at(0x7A94);	// @ (0xF52 * 8 + 4)
#define                                 ECCP2AS0_bit        _BIT_ACCESS(ECCP2AS,4)
// ECCP2AS<ECCP2AS1>
extern volatile __bit                   ECCP2AS1            __at(0x7A95);	// @ (0xF52 * 8 + 5)
#define                                 ECCP2AS1_bit        _BIT_ACCESS(ECCP2AS,5)
// ECCP2AS<ECCP2AS2>
extern volatile __bit                   ECCP2AS2            __at(0x7A96);	// @ (0xF52 * 8 + 6)
#define                                 ECCP2AS2_bit        _BIT_ACCESS(ECCP2AS,6)
// ECCP2AS<ECCP2ASE>
extern volatile __bit                   ECCP2ASE            __at(0x7A97);	// @ (0xF52 * 8 + 7)
#define                                 ECCP2ASE_bit        _BIT_ACCESS(ECCP2AS,7)
// ECCP3AS<ECCP3AS0>
extern volatile __bit                   ECCP3AS0            __at(0x7A6C);	// @ (0xF4D * 8 + 4)
#define                                 ECCP3AS0_bit        _BIT_ACCESS(ECCP3AS,4)
// ECCP3AS<ECCP3AS1>
extern volatile __bit                   ECCP3AS1            __at(0x7A6D);	// @ (0xF4D * 8 + 5)
#define                                 ECCP3AS1_bit        _BIT_ACCESS(ECCP3AS,5)
// ECCP3AS<ECCP3AS2>
extern volatile __bit                   ECCP3AS2            __at(0x7A6E);	// @ (0xF4D * 8 + 6)
#define                                 ECCP3AS2_bit        _BIT_ACCESS(ECCP3AS,6)
// ECCP3AS<ECCP3ASE>
extern volatile __bit                   ECCP3ASE            __at(0x7A6F);	// @ (0xF4D * 8 + 7)
#define                                 ECCP3ASE_bit        _BIT_ACCESS(ECCP3AS,7)
// CTMUCONL<EDG1POL>
extern volatile __bit                   EDG1POL             __at(0x7AB4);	// @ (0xF56 * 8 + 4)
#define                                 EDG1POL_bit         _BIT_ACCESS(CTMUCONL,4)
// CTMUCONL<EDG1SEL0>
extern volatile __bit                   EDG1SEL0            __at(0x7AB2);	// @ (0xF56 * 8 + 2)
